In [1]:
import pandas as pd

In [12]:
df = pd.DataFrame([
        {
            "Name" : "A 회사",
            "Age" : 30,
            "학교" : "인하대",
        },
        {
            "Name" : "A 회사",
            "Age" : 28,
            "학교" : "고려대",
        },
        {
            "Name" : "B 회사",
            "Age" : 22,
            "학교" : "인하대",
        },
        {
            "Name" : "B 회사",
            "Age" : 37,
            "학교" : "인하대",
        },
        {
            "Name" : "B 회사",
            "Age" : 43,
            "학교" : "서울대",
        },
    ])

In [13]:
df

   Age  Name   학교
0   30  A 회사  인하대
1   28  A 회사  고려대
2   22  B 회사  인하대
3   37  B 회사  인하대
4   43  B 회사  서울대

### 단순히 개수를 카운팅할 경우, groupby 후 size()를 하면 되지만! 2중 필터링을 해야되는 경우엔..?

### ex) 회사별 인원수 파악

In [14]:
df.groupby("Name").size()

Name
A 회사    2
B 회사    3
dtype: int64

In [24]:
# groupby를 사용하지 않는 경우!
df["Name"].value_counts()

B 회사    3
A 회사    2
Name: Name, dtype: int64

### ex2) 회사별 인원수가 2명인 기업은 몇개? 3명인 기업은 몇개?

In [15]:
df.groupby("Name").size().value_counts()

3    1
2    1
dtype: int64

### 리스트에 있는 회사의 총 개수를 알고 싶은 경우엔 이렇게

In [16]:
len(df["Name"].unique())

2

### pivot 테이블처럼 보일 수 있음! describe를 사용-!

In [22]:
df.groupby("Name").describe()

                  Age
Name
A 회사 count   2.000000
     mean   29.000000
     std     1.414214
     min    28.000000
     25%    28.500000
     50%    29.000000
     75%    29.500000
     max    30.000000
B 회사 count   3.000000
     mean   34.000000
     std    10.816654
     min    22.000000
     25%    29.500000
     50%    37.000000
     75%    40.000000
     max    43.000000